###############################################################
# Generic show script derived from the Yosys README file      #
#							      #
# Usage: yosys infile.v synth.ys -b edif -o outfile.edif      #
###############################################################

hierarchy -auto-top; proc; opt; fsm; opt; techmap; opt; 
abc -g AND,NAND,OR,NOR,XOR,XNOR,MUX,AOI3,OAI3,AOI4,OAI4;  
opt; clean

show -format png 
